In [1]:
import pandas as pd
import numpy as np
import sqlite3
import mysql.connector

the sql query to retrieve the data desired and sort that data by last name and first name

In [4]:
sql_query = '''SELECT Customer.LastName, Customer.FirstName, Track.Name, Album.Title from Customer 
LEFT JOIN Invoice 
ON Customer.CustomerId = Invoice.CustomerId 
LEFT JOIN InvoiceLine 
ON Invoice.InvoiceId = InvoiceLine.InvoiceId 
LEFT JOIN Track 
ON InvoiceLine.TrackId = Track.TrackId 
LEFT JOIN Album 
ON Track.AlbumId = Album.AlbumId 
ORDER BY Customer.LastName, Customer.FirstName;'''

import data using sqlite3
path to the sqlite database and the connector to the database

In [5]:
db_chinook = 'C:\\Users\\dbech\\Documents\\IS362\\project_3\\Chinook_Sqlite.sqlite'
conn = sqlite3.connect(db_chinook)

read the quesry results in to a pandas dataframe and display the first five rows.

In [6]:
customer_info = pd.read_sql_query(sql_query, con=conn)

display the first 5 rows of data

In [7]:
customer_info.head()

,LastName,FirstName,Name,Title
0,Almeida,Roberto,Right Next Door to Hell,Use Your Illusion I
1,Almeida,Roberto,In The Evening,In Through The Out Door
2,Almeida,Roberto,Fool In The Rain,In Through The Out Door
3,Almeida,Roberto,Saudade Dos Aviões Da Panair (Conversando No Bar),Minas
4,Almeida,Roberto,Caso Você Queira Saber,Minas

import data using MySQL file

Create the connector for the MySQL database

In [8]:
conn2 = mysql.connector.connect(host='LOCALHOST', user='root', password='Vipergts1', database='chinook')

load the MySQL data into a pandas dataframe using the sql query create above (sql)

In [9]:
sql_customer_info = pd.read_sql(sql_query, con=conn2)

display the first 5 rows of data

In [10]:
sql_customer_info.head()

,LastName,FirstName,Name,Title
0,Almeida,Roberto,Right Next Door to Hell,Use Your Illusion I
1,Almeida,Roberto,In The Evening,In Through The Out Door
2,Almeida,Roberto,Fool In The Rain,In Through The Out Door
3,Almeida,Roberto,Saudade Dos Aviões Da Panair (Conversando No Bar),Minas
4,Almeida,Roberto,Caso Você Queira Saber,Minas